Revit 2027 API
Family.GetFamilySymbolIds Method
 Gets the ids of the FamilySymbols owned by this Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetFamilySymbolIds()
Public Function GetFamilySymbolIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetFamilySymbolIds()
member GetFamilySymbolIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The ids of the FamilySymbols.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace